/*
	Покажчики. Приклад 5
В одновимірному динамічному масиві:
а) переписати значення п'ятого елемента в змінну q
б) замінити п'ятий елемент числом 1000
в) роздрукувати масив за допомогою покажчиків
*/

#include <iostream>
#include <Windows.h>
using namespace std;

void main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	// Встановлення розміру масиву
	int SIZE = 10;
	int q;
	
	// Резервування місця в пам'яті під масив
	// з int елементів в кількості SIZE
	int* pArr = new int[SIZE];
	
	// Заповнення масиву
	cout << "Початковий масив: \n ";
	for (int i = 0; i < SIZE; i++)
	{
		// Використання відносної адресації
		*(pArr + i) = rand() % 25;
		cout << *(pArr + i) << "\t";
	}

	// а) 
	q = *(pArr + 4);
	cout << "\nq = " << q << endl;

	// б)
	*(pArr + 4) = 1000;
	cout << "п'ятому елементу присвоєно значення ";
	cout << *(pArr + 4) << endl;

	// в)
	cout << "Вихідний масив: \n ";
	for (int i = 0; i < SIZE; i++)
	{
		// Використання відносної адресації
		cout << *(pArr + i) << "\t";
	}
		
	// Звільнення пам'яті
	delete [] pArr;
}