/*
	Покажчики. Приклад 4
Ввести дані з клавіатури в одновимірний 
динамічний масив.
Переписати в інший масив подвоєні значення.
*/

#include <iostream>
using namespace std;

#define SIZE 5

void main()
{
	int B[SIZE], i;
	
	// Резервування місця в пам'яті під масив з 
	// int елементів в кількості SIZE
	int* pArr = (int*)malloc(SIZE * sizeof(int));
	// Запам'ятовування початку масиву
	int* pArr_start = pArr;
	
	// Заповнення масиву з клавіатури
	for (int i = 0; i < SIZE; i++)
	{
		//scanf("%d ", p++);
		cin >> *pArr;
		// Пересування по масиву за допомогою
		// абсолютної адресації
		pArr++;
	}
	
	// Повернення покажчика на початок масиву
	// тому що він був зміщений абсолютної адресацією
	pArr = pArr_start;

	// Перезапис масиву pArr в масив B
	// відповідно до завдання
	for (int i = 0; i < SIZE; i++)
	{
		B[i] = (*pArr) * 2;
		pArr++;
		cout << B[i] << "\t";
	}
	
	// Повернення покажчика на початок масиву знову
	pArr = pArr_start;
	// Звільнення пам'яті
	free(pArr);	
}