/********************************************************/
/*                Лабораторная работа №10               */
/*               Структуры и массивы структур           */
/*              Пример выполнения. Вариант №30.         */
/********************************************************/
#include <stdio.h>
#include <string.h>
#include <iostream>
/* Описание структуры, которая представляет монастырь */
struct mon {
	char name[15]; /* название */
	char sc;       /* школа */
	int cnt;       /* количество монахов */
	float sq;      /* площадь */
} mm[10]; /* определение массива монастирей */
int main(void) {
	setlocale(LC_ALL, "ru");
	std::system("chcp 1251");
	struct mon x; /* рабочая переменная */
	int n;    /* количество элементов в массиве */
	int i, j; /* текущие индексы в массиве */
	int m;    /* индекс минимального элемента */
	float sqx;/* рабочая переменная */
	 /* Ввод данных */
	 /*	Тодайдзи Т 220 368,8
		Якусидзи С 50 54,7
		Дайаедзи Д 10 12,2 */
	for (n = 0; n < 10; n++) {
		printf("%d. Введите: название, школу, количество, площадь >",
			n + 1);
		scanf_s("%s", mm[n].name, sizeof(mm[n].name));
		if (!strcmp(mm[n].name, "***")) break;
		scanf_s("%s", &mm[n].sc, sizeof(mm[n].name));
		scanf_s("%d", &mm[n].cnt);
		/* Внимание! Мы обходим ошибку в системе программирования */
		scanf_s("%f", &mm[n].sq); //mm[n].sq = sqx;
	}
	/* Вывод таблицы */
	printf("---------------------------------------------\n");
	printf("|Буддийские монастыри Японии периода Нара    |\n");
	printf("|--------------------------------------------|\n");
	printf("| Название  | Школа |Количество|   Площадь   |\n");
	printf("|           |       |  монахов | земель(га)  |\n");
	printf("|-----------|-------|----------|-------------|\n");
	/* вывод строк фактических данных */
	for (i = 0; i < n; i++)
		printf("| %9s |   %c   | %8d | %-11.1f |\n",
			mm[i].name, mm[i].sc, mm[i].cnt, mm[i].sq);
	printf("---------------------------------------------\n");
	/* сортировка массива */
	for (i = 0; i < n - 1; i++) {
		m = i; /* минимальный элемент - первый */
		for (j = i + 1; j < n; j++)
			/* если текущий элемент > минимального,
			   он становится минимальным */
			if (strcmp(mm[m].name, mm[j].name) > 0) m = j;
		if (m > i) {
			/* перестановка первого и минимального элементов */
			/*strcpy_s(x.name, mm[i].name); x.sc = mm[i].sc;
			x.cnt = mm[i].cnt; x.sq = mm[i].sq;
			strcpy_s(mm[i].name, mm[m].name); mm[i].sc = mm[m].sc;
			mm[i].cnt = mm[m].cnt; mm[i].sq = mm[m].sq;
			strcpy_s(mm[m].name, x.name); mm[m].sc = x.sc;
			mm[m].cnt = x.cnt; mm[m].sq = x.sq;*/
			// Можно это же сделать так:
			x = mm[i];
			mm[i] = mm[m];
			mm[m] = x;
		}
	}
	/* Вывод таблицы */
	printf("---------------------------------------------\n");
	printf("|Буддийские монастыри Японии периода Нара    |\n");
	printf("|--------------------------------------------|\n");
	printf("| Название  | Школа |Количество|   Площадь   |\n");
	printf("|           |       |  монахов | земель(га)  |\n");
	printf("|-----------|-------|----------|-------------|\n");
	for (i = 0; i < n; i++)
		printf("| %9s |   %c   | %8d | %-11.1f |\n",
			mm[i].name, mm[i].sc, mm[i].cnt, mm[i].sq);
	printf("---------------------------------------------\n");
	return 0;
}