/*
	Рядки в стилі С.
Приклад 2
Написати функцію, яка розбиває рядок на 2 частини:
до першого входження заданого символу і після нього
НЕ ВИКОРИСТОВУВАТИ стандартні функції C
*/

#include <iostream>
#include <Windows.h>
using namespace std;

/*
S - вхідний рядок
S1 - рядок до
S2 - рядок після
ch - символ
*/
void fun(char* S, char* S1, char* S2, char ch)
{
	// 1) до символу 9
	while (*S != ch) {
		*S1 = *S;
		S1++; S++;
	}
	// 2) установка ознаки кінця рядка
	*S1 = '\0';
	// 3) обхід символу 9
	S++;
	// 4) після символу 9
	while (*S != 0) {
		*S2 = *S;
		S2++; S++;
	}
	// 5) установка ознаки кінця рядка
	*S2 = '\0';
}

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);	
	//char S [] = "1234567890543";
	char S[80];
	gets_s(S);
	char S1[80];
	char S2[80];
	char ch = '9';
	fun(S, S1, S2, ch);
	puts(S1);
	puts(S2);	
}